src/Reports/TrialBalance.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Report>
		<Properties>
			<Name>TrialBalance</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/Enums/AccountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>AccountTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AccountsPayable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsReceivable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccumulatedDepreciation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CostOfSales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Equity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FixedAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Income</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LongTermLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherExpense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherNonCurrentAsset</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>USTaxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor1099</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiddleName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Country</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bank</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Banks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Website</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Notes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Fax</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/TrialBalance/Ext/ObjectModule.bsl
Function TrialBalance(Date) Export
		
	If Date = Date(1,1,1) Then
		Date = CurrentDate();		
	EndIf;
	
	PeriodLabel = Format(Date, "DLF=D");
	
	ReportDate = BegOfDay(Date) + 60 * 60 * 24;
	
	OurCompany = Catalogs.Companies.OurCompany;
	
	SpreadsheetDocument = New SpreadsheetDocument;
	Template = GetTemplate("Template");
	
	Header = Template.GetArea("Header");
	Header.Parameters.PeriodLabel = PeriodLabel;
	Header.Parameters.Company = GeneralFunctions.GetAttributeValue(OurCompany, "Name");
	SpreadsheetDocument.Put(Header);
	
	Reg = AccountingRegisters.GeneralJournal;
	
	TotalDr = 0;
	TotalCr = 0;
	
	// Main section
	
	AccountBalances = Template.GetArea("AccountBalances");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref,
	                  |	ChartOfAccounts.AccountType
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		Dataset = QueryResult.Choose();
		While Dataset.Next() Do
			
			Filter = New Structure("Account", Dataset.Ref);	
			AccBalance = Reg.Balance(ReportDate,,Filter);
			
			If Dataset.AccountType = Enums.AccountTypes.AccountsReceivable OR
			Dataset.AccountType = Enums.AccountTypes.AccumulatedDepreciation OR
		    Dataset.AccountType = Enums.AccountTypes.Bank OR
			Dataset.AccountType = Enums.AccountTypes.CostOfSales OR
			Dataset.AccountType = Enums.AccountTypes.Expense OR
			Dataset.AccountType = Enums.AccountTypes.FixedAsset OR
			Dataset.AccountType = Enums.AccountTypes.Inventory OR
			Dataset.AccountType = Enums.AccountTypes.OtherCurrentAsset OR
			Dataset.AccountType = Enums.AccountTypes.OtherExpense OR
			Dataset.AccountType = Enums.AccountTypes.OtherNonCurrentAsset Then				
				Debit = AccBalance.Total("AmountRCBalanceDr") - AccBalance.Total("AmountRCBalanceCr");
				Credit = 0;
			Else
				Debit = 0;
				Credit = -1 * (AccBalance.Total("AmountRCBalanceDr") - AccBalance.Total("AmountRCBalanceCr"));
			EndIf;
			
			TotalDr = TotalDr + Debit;
			TotalCr = TotalCr + Credit;
			
			Selection = New Structure("Account, Debit, Credit");
			Selection.Insert("Account", Dataset.Ref.Description);
			Selection.Insert("Debit", Debit);
			Selection.Insert("Credit", Credit);
			
			AccountBalances.Parameters.Fill(Selection);
			SpreadsheetDocument.Put(AccountBalances);				 
		EndDo;
	EndIf;
	
	// Totals
	
	Totals = Template.GetArea("Totals");
	Totals.Parameters.TotalDebit = TotalDr;
	Totals.Parameters.TotalCredit = TotalCr;
	SpreadsheetDocument.Put(Totals);
	
	// Return result
	
	Return SpreadSheetDocument;
	
EndFunction
